<?php 

namespace app\models\enums;

use yii2mod\enum\helpers\BaseEnum;

class Sity extends BaseEnum 
{
    public static $list = [
        '1' => 'Москва',
        '2' => 'Санкт-Петербург',
        '3' => 'Новосибирск',
        '4' => 'Екатеринбург',
        '5' => 'Нижний Новгород',
        '6' => 'Самара',
        '7' => 'Омск',
        '8' => 'Казань',
        '9' => 'Челябинск',
        '10' => 'Ростов-на-Дону',
        '11' => 'Уфа',
        '12' => 'Волгоград',
        '13' => 'Пермь',
        '14' => 'Красноярск',
        '15' => 'Воронеж',
        '16' => 'Саратов',
        '17' => 'Краснодар',
        '18' => 'Тольятти',
        '19' => 'Ижевск',
        '20' => 'Ульяновск',
        '21' => 'Барнаул',
        '22' => 'Владивосток',
        '23' => 'Ярославль',
        '24' => 'Иркутск',
        '25' => 'Тюмень',
        '26' => 'Махачкала',
    ];
}